# Installation dependencies and settings
# -----------------------------------------------------------------------------
cask_args appdir: "/Applications"

# Additional sources
# -----------------------------------------------------------------------------
tap "babashka/brew"
tap "clojure/tools"
tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"

# Spell checker with better logic than ispell
brew "aspell"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Rust-based GNU File, Shell, and Text utilities
brew "uutils-coreutils"
brew "uutils-diffutils"
brew "uutils-findutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Modern replacement for 'ls'
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Fast Node Manager - like nvm but better?
brew "fnm"
# GNU awk utility
brew "gawk"
# Distributed revision control system
brew "git"
cask "git-credential-manager"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Manage installed versions of java
brew "jabba"
# Manage your Java environment
brew "jenv"
# Mac App Store command-line interface
brew "mas"
# Remote terminal application
brew "mosh"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Python version management
brew "pyenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Minimal, fast(rust-based) customizable shell prompt
brew "starship"
# Simpler man pages that will give only the examples
brew "tldr"
# Syntax tree-sitter
brew "tree-sitter"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Tracks most-used directories to make cd smarter
brew "z"
# UNIX shell (command interpreter)
brew "zsh"
# The Clojure Programming Language
brew "clojure/tools/clojure"
# Memory training application
cask "anki"
# Offline programming language reference documentation
cask "dash@6"
# Draw.io/diagrams.net diagram software
cask "drawio"
# IDE for Java development - community edition
cask "intellij-idea-ce"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Music streaming service
cask "spotify"
# Video communication and virtual meeting platform
cask "zoom"
# Emacs - will install a lot of dependencies to compile - may need libvterm
brew "d12frosted/emacs-plus/emacs-plus@29", args: ["with-native-comp", "with-no-frame-refocus", "with-poll"]
# Ad-hoc ClojureScript scripting of Mac applications via Apple's Open Scripting Architecture
brew "babashka/brew/obb"
# Native, fast starting Clojure interpreter for scripting
brew "borkdude/brew/babashka"
# Transform JSON into EDN into Transit
brew "borkdude/brew/jet"

# Font for Emacs
cask "font-source-code-pro"

# Cheap-ish web blocker working across all devices
mas "1Blocker", id: 1107421413

mas "DuckDuckGo Privacy Essentials", id: 1482920575

mas "Xcode", id: 497799835
