tap "adoptopenjdk/openjdk"
tap "aws/tap"
tap "borkdude/brew"
tap "clojure/tools"
tap "daviderestivo/emacs-head"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
# Spell checker with better logic than ispell
brew "aspell"
# Automatic configure script builder
brew "autoconf"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# GNU database manager
brew "gdbm"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Low-level library for pixel manipulation
brew "pixman"
# GNU File, Shell, and Text utilities
brew "coreutils"
# C string library for manipulating Unicode strings
brew "libunistring"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# GNU multiple precision arithmetic library
brew "gmp"
# GNU awk utility
brew "gawk"
# Distributed revision control system
brew "git"
# Manage compile and link flags for libraries
brew "pkg-config"
# Asynchronous event library
brew "libevent"
# Common error values for all GnuPG components
brew "libgpg-error"
# Cryptographic library based on the code from GnuPG
brew "libgcrypt"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Manage your Java environment
brew "jenv"
# Mac App Store command-line interface
brew "mas"
# Remote terminal application
brew "mosh"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Manage multiple Node.js versions
brew "nvm"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Cross-platform application and UI framework
brew "qt"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Tracks most-used directories to make cd smarter
brew "z"
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
# A minimal and opinionated linter for Clojure code that sparks joy.
brew "borkdude/brew/clj-kondo"
# The Clojure Programming Language
brew "clojure/tools/clojure"
# GNU Emacs text editor
brew "daviderestivo/emacs-head/emacs-head@28", args: ["with-cocoa", "with-jansson", "with-no-frame-refocus", "without-imagemagick@7"]
# AdoptOpenJDK OpenJDK (Java) Development Kit
cask "adoptopenjdk11"
# Application launcher and productivity software
cask "alfred"
# Memory training application
cask "anki"
# Menu bar application that lists iCloud Tabs
cask "cloudytabs"
# API documentation browser and code snippet manager
cask "dash"
# Draw.io is free online diagram software
cask "drawio"
cask "font-fira-code"
cask "font-fira-mono"
cask "font-fira-mono-for-powerline"
cask "font-source-code-pro"
# Web browser
cask "google-chrome"
# IDE for Java development - community edition
cask "intellij-idea-ce"
# Tool to prevent the system from going into sleep mode
cask "keepingyouawake"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Open-source code editor
cask "visual-studio-code"
# Video communication and virtual meeting platform
cask "zoom"
# Collect, organize, cite, and share research sources
cask "zotero"
mas "1Blocker", id: 1107421413
mas "DuckDuckGo Privacy Essentials", id: 1482920575
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Tadam", id: 531349534
mas "Vimari", id: 1480933944
mas "Xcode", id: 497799835
